app/models/concerns/current_cart.rb

SELECT `carts`.* FROM `carts` WHERE `carts`.`id` = 1 LIMIT 1
INSERT INTO `carts` (`created_at`, `updated_at`) VALUES ('2022-07-22 11:22:19.599314', '2022-07-22 11:22:19.599314')
---
    def set_cart
      @cart = Cart.find(session[:cart_id])
    rescue ActiveRecord::RecordNotFound
        @cart = Cart.create