app/helpers/application_helper.rb

SELECT COUNT(*) FROM `line_items` WHERE `line_items`.`cart_id` = 3
---
  def cart_count_over_one
    return "<span>#{@cart.line_items.count} </span>".html_safe if @cart.line_items.count.positive?

SELECT COUNT(*) FROM `line_items` WHERE `line_items`.`cart_id` = 3
SELECT `line_items`.* FROM `line_items` WHERE `line_items`.`cart_id` = 3
---
  def cart_has_items
    @cart.line_items.count.positive?