app/controllers/carts_controller.rb

SELECT `line_items`.* FROM `line_items` WHERE `line_items`.`cart_id` = 1
---
  def show
  @mus = LineItem.all

DELETE FROM `carts` WHERE `carts`.`id` = 1
---
  def destroy
    @cart.destroy if @cart.id == session[:cart_id]