app/controllers/line_items_controller.rb

  def create
    product = Product.find(params[:product_id])
    @line_item = @cart.add_product(product)

    respond_to do |format|
      if @line_item.save
---
SELECT `products`.* FROM `products` WHERE `products`.`id` = 7 LIMIT 1
INSERT INTO `line_items` (`product_id`, `cart_id`, `created_at`, `updated_at`) VALUES (7, 1, '2022-07-22 11:31:58.842083', '2022-07-22 11:31:58.842083')
UPDATE `line_items` SET `line_items`.`updated_at` = '2022-07-22 17:06:25.511858', `line_items`.`quantity` = 2 WHERE `line_items`.`id` = 6

  def destroy
    @cart = Cart.find(session[:cart_id])
    @line_item.destroy
---
SELECT `carts`.* FROM `carts` WHERE `carts`.`id` = 7 LIMIT 1
DELETE FROM `line_items` WHERE `line_items`.`id` = 13

    def set_line_item
      @line_item = LineItem.find(params[:id])
---
SELECT `line_items`.* FROM `line_items` WHERE `line_items`.`id` = 1 LIMIT 1