app/controllers/products_controller.rb

SELECT `products`.* FROM `products` ORDER BY created_at desc
---
  def index
    @products = Product.all.order("created_at desc")

INSERT INTO `products` (`brand`, `model`, `description`, `condition`, `finish`, `title`, `price`, `created_at`, `updated_at`, `image`, `user_id`) VALUES ('allen solly', 'shirt', '100% cotton and easy to wash', 'excellent', 'blue', 'fashion', 300.0, '2022-07-20 09:30:33.708103', '2022-07-20 09:30:33.708103', '#<ActionDispatch::Http::UploadedFile:0x00007f811416f4a8>', 2)
---
  def create
    @product = current_user.products.build(product_params)

    respond_to do |format|
      if @product.save

UPDATE `products` SET `products`.`updated_at` = '2022-07-20 09:35:01.200789', `products`.`image` = '#<ActionDispatch::Http::UploadedFile:0x00007f81141ee550>' WHERE `products`.`id` = 1
---
  def update
    respond_to do |format|
      if @product.update(product_params)