app/controllers/products_controller.rb

DELETE FROM `products` WHERE `products`.`id` = 2
---
  def destroy
    @product = Product.find(params[:id])
    @product.destroy