app/views/products/show.html.erb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 ORDER BY `users`.`id` ASC LIMIT 1
---
                  <% review_user = review.user_id %>
                  <% from_user = User.where(id: review_user) %>